susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32L021.h
/*
 * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
 * Timestamp: 2023-12-12T18:58:56.347847
 */

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define COMP1_OUT_PA0_ PA0,GPIO_AF7
#define COMP1_OUT_PA10_ PA10,GPIO_AF7
#define COMP1_OUT_PA11_ PA11,GPIO_AF7
#define COMP1_OUT_PA13_ PA13,GPIO_AF7
#define COMP1_OUT_PA6_ PA6,GPIO_AF7
#define COMP1_OUT_PA9_ PA9,GPIO_AF7
#define _COMP1_OUT_PA0_ 1
#define _COMP1_OUT_PA10_ 1
#define _COMP1_OUT_PA11_ 1
#define _COMP1_OUT_PA13_ 1
#define _COMP1_OUT_PA6_ 1
#define _COMP1_OUT_PA9_ 1

#define COMP2_OUT_PA12_ PA12,GPIO_AF7
#define COMP2_OUT_PA14_ PA14,GPIO_AF7
#define COMP2_OUT_PA2_ PA2,GPIO_AF7
#define COMP2_OUT_PA4_ PA4,GPIO_AF7
#define COMP2_OUT_PA7_ PA7,GPIO_AF7
#define _COMP2_OUT_PA12_ 1
#define _COMP2_OUT_PA14_ 1
#define _COMP2_OUT_PA2_ 1
#define _COMP2_OUT_PA4_ 1
#define _COMP2_OUT_PA7_ 1

#define EVENTOUT_PA1_ PA1,GPIO_AF0
#define EVENTOUT_PA11_ PA11,GPIO_AF2
#define EVENTOUT_PA12_ PA12,GPIO_AF2
#define EVENTOUT_PA15_ PA15,GPIO_AF3
#define EVENTOUT_PA6_ PA6,GPIO_AF6
#define EVENTOUT_PA7_ PA7,GPIO_AF6
#define EVENTOUT_PA8_ PA8,GPIO_AF3
#define EVENTOUT_PB0_ PB0,GPIO_AF0
#define EVENTOUT_PB3_ PB3,GPIO_AF4
#define EVENTOUT_PB4_ PB4,GPIO_AF2
#define EVENTOUT_PB8_ PB8,GPIO_AF2
#define _EVENTOUT_PA1_ 1
#define _EVENTOUT_PA11_ 1
#define _EVENTOUT_PA12_ 1
#define _EVENTOUT_PA15_ 1
#define _EVENTOUT_PA6_ 1
#define _EVENTOUT_PA7_ 1
#define _EVENTOUT_PA8_ 1
#define _EVENTOUT_PB0_ 1
#define _EVENTOUT_PB3_ 1
#define _EVENTOUT_PB4_ 1
#define _EVENTOUT_PB8_ 1

#define I2C1_SCL_PA4_ PA4,GPIO_AF3
#define I2C1_SCL_PA9_ PA9,GPIO_AF1
#define I2C1_SCL_PB6_ PB6,GPIO_AF1
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PA4_ 1
#define _I2C1_SCL_PA9_ 1
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PA10_ PA10,GPIO_AF1
#define I2C1_SDA_PA13_ PA13,GPIO_AF3
#define I2C1_SDA_PB7_ PB7,GPIO_AF1
#define _I2C1_SDA_PA10_ 1
#define _I2C1_SDA_PA13_ 1
#define _I2C1_SDA_PB7_ 1

#define I2C1_SMBA_PA1_ PA1,GPIO_AF3
#define I2C1_SMBA_PA14_ PA14,GPIO_AF3
#define I2C1_SMBA_PB5_ PB5,GPIO_AF3
#define _I2C1_SMBA_PA1_ 1
#define _I2C1_SMBA_PA14_ 1
#define _I2C1_SMBA_PB5_ 1

#define LPTIM1_ETR_PA13_ PA13,GPIO_AF1
#define LPTIM1_ETR_PA4_ PA4,GPIO_AF2
#define LPTIM1_ETR_PA6_ PA6,GPIO_AF1
#define LPTIM1_ETR_PB6_ PB6,GPIO_AF2
#define _LPTIM1_ETR_PA13_ 1
#define _LPTIM1_ETR_PA4_ 1
#define _LPTIM1_ETR_PA6_ 1
#define _LPTIM1_ETR_PB6_ 1

#define LPTIM1_IN1_PA0_ PA0,GPIO_AF1
#define LPTIM1_IN1_PA4_ PA4,GPIO_AF1
#define LPTIM1_IN1_PA8_ PA8,GPIO_AF2
#define LPTIM1_IN1_PB1_ PB1,GPIO_AF2
#define LPTIM1_IN1_PB5_ PB5,GPIO_AF2
#define _LPTIM1_IN1_PA0_ 1
#define _LPTIM1_IN1_PA4_ 1
#define _LPTIM1_IN1_PA8_ 1
#define _LPTIM1_IN1_PB1_ 1
#define _LPTIM1_IN1_PB5_ 1

#define LPTIM1_IN2_PA1_ PA1,GPIO_AF1
#define LPTIM1_IN2_PA5_ PA5,GPIO_AF1
#define LPTIM1_IN2_PB7_ PB7,GPIO_AF2
#define _LPTIM1_IN2_PA1_ 1
#define _LPTIM1_IN2_PA5_ 1
#define _LPTIM1_IN2_PB7_ 1

#define LPTIM1_OUT_PA11_ PA11,GPIO_AF1
#define LPTIM1_OUT_PA14_ PA14,GPIO_AF1
#define LPTIM1_OUT_PA7_ PA7,GPIO_AF1
#define LPTIM1_OUT_PA9_ PA9,GPIO_AF2
#define LPTIM1_OUT_PB2_ PB2,GPIO_AF2
#define _LPTIM1_OUT_PA11_ 1
#define _LPTIM1_OUT_PA14_ 1
#define _LPTIM1_OUT_PA7_ 1
#define _LPTIM1_OUT_PA9_ 1
#define _LPTIM1_OUT_PB2_ 1

#define LPUART1_CTS_PA6_ PA6,GPIO_AF4
#define _LPUART1_CTS_PA6_ 1

#define LPUART1_DE_PB1_ PB1,GPIO_AF4
#define _LPUART1_DE_PB1_ 1

#define LPUART1_RTS_PB1_ PB1,GPIO_AF4
#define _LPUART1_RTS_PB1_ 1

#define LPUART1_RX_PA0_ PA0,GPIO_AF6
#define LPUART1_RX_PA13_ PA13,GPIO_AF6
#define LPUART1_RX_PA3_ PA3,GPIO_AF6
#define LPUART1_RX_PB7_ PB7,GPIO_AF6
#define _LPUART1_RX_PA0_ 1
#define _LPUART1_RX_PA13_ 1
#define _LPUART1_RX_PA3_ 1
#define _LPUART1_RX_PB7_ 1

#define LPUART1_TX_PA1_ PA1,GPIO_AF6
#define LPUART1_TX_PA14_ PA14,GPIO_AF6
#define LPUART1_TX_PA2_ PA2,GPIO_AF6
#define LPUART1_TX_PA4_ PA4,GPIO_AF6
#define LPUART1_TX_PB6_ PB6,GPIO_AF6
#define _LPUART1_TX_PA1_ 1
#define _LPUART1_TX_PA14_ 1
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PA4_ 1
#define _LPUART1_TX_PB6_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define RCC_MCO_PA9_ PA9,GPIO_AF0
#define _RCC_MCO_PA8_ 1
#define _RCC_MCO_PA9_ 1

#define RTC_REFIN_PA10_ PA10,GPIO_AF2
#define _RTC_REFIN_PA10_ 1

#define SPI1_MISO_PA11_ PA11,GPIO_AF0
#define SPI1_MISO_PA14_ PA14,GPIO_AF5
#define SPI1_MISO_PA6_ PA6,GPIO_AF0
#define SPI1_MISO_PB0_ PB0,GPIO_AF1
#define SPI1_MISO_PB4_ PB4,GPIO_AF0
#define _SPI1_MISO_PA11_ 1
#define _SPI1_MISO_PA14_ 1
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB0_ 1
#define _SPI1_MISO_PB4_ 1

#define SPI1_MOSI_PA12_ PA12,GPIO_AF0
#define SPI1_MOSI_PA7_ PA7,GPIO_AF0
#define SPI1_MOSI_PB1_ PB1,GPIO_AF1
#define SPI1_MOSI_PB5_ PB5,GPIO_AF0
#define _SPI1_MOSI_PA12_ 1
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB1_ 1
#define _SPI1_MOSI_PB5_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF0
#define SPI1_NSS_PA4_ PA4,GPIO_AF0
#define SPI1_NSS_PB8_ PB8,GPIO_AF5
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PB8_ 1

#define SPI1_SCK_PA13_ PA13,GPIO_AF5
#define SPI1_SCK_PA5_ PA5,GPIO_AF0
#define SPI1_SCK_PB3_ PB3,GPIO_AF0
#define _SPI1_SCK_PA13_ 1
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1

#define SYS_SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_SWCLK_PA14_ 1

#define SYS_SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_SWDIO_PA13_ 1

#define TIM21_CH1_PA10_ PA10,GPIO_AF0
#define TIM21_CH1_PA2_ PA2,GPIO_AF0
#define TIM21_CH1_PB5_ PB5,GPIO_AF5
#define _TIM21_CH1_PA10_ 1
#define _TIM21_CH1_PA2_ 1
#define _TIM21_CH1_PB5_ 1

#define TIM21_CH2_PA11_ PA11,GPIO_AF5
#define TIM21_CH2_PA3_ PA3,GPIO_AF0
#define TIM21_CH2_PA9_ PA9,GPIO_AF5
#define _TIM21_CH2_PA11_ 1
#define _TIM21_CH2_PA3_ 1
#define _TIM21_CH2_PA9_ 1

#define TIM21_ETR_PA1_ PA1,GPIO_AF5
#define TIM21_ETR_PA7_ PA7,GPIO_AF5
#define _TIM21_ETR_PA1_ 1
#define _TIM21_ETR_PA7_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF2
#define TIM2_CH1_PA15_ PA15,GPIO_AF5
#define TIM2_CH1_PA5_ PA5,GPIO_AF5
#define TIM2_CH1_PA8_ PA8,GPIO_AF5
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1
#define _TIM2_CH1_PA8_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF2
#define TIM2_CH2_PB0_ PB0,GPIO_AF2
#define TIM2_CH2_PB3_ PB3,GPIO_AF2
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB0_ 1
#define _TIM2_CH2_PB3_ 1

#define TIM2_CH3_PA10_ PA10,GPIO_AF5
#define TIM2_CH3_PA2_ PA2,GPIO_AF2
#define TIM2_CH3_PB0_ PB0,GPIO_AF5
#define TIM2_CH3_PB6_ PB6,GPIO_AF5
#define _TIM2_CH3_PA10_ 1
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB0_ 1
#define _TIM2_CH3_PB6_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF2
#define TIM2_CH4_PB1_ PB1,GPIO_AF5
#define TIM2_CH4_PB7_ PB7,GPIO_AF5
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB1_ 1
#define _TIM2_CH4_PB7_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF5
#define TIM2_ETR_PA15_ PA15,GPIO_AF2
#define TIM2_ETR_PA4_ PA4,GPIO_AF5
#define TIM2_ETR_PA5_ PA5,GPIO_AF2
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA4_ 1
#define _TIM2_ETR_PA5_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF4
#define UART2_CK_PA8_ PA8,GPIO_AF4
#define UART2_CK_PB1_ PB1,GPIO_AF0
#define _UART2_CK_PA4_ 1
#define _UART2_CK_PA8_ 1
#define _UART2_CK_PB1_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF4
#define UART2_CTS_PA11_ PA11,GPIO_AF4
#define UART2_CTS_PA7_ PA7,GPIO_AF4
#define _UART2_CTS_PA0_ 1
#define _UART2_CTS_PA11_ 1
#define _UART2_CTS_PA7_ 1

#define UART2_DE_PA1_ PA1,GPIO_AF4
#define UART2_DE_PA12_ PA12,GPIO_AF4
#define UART2_DE_PB0_ PB0,GPIO_AF4
#define _UART2_DE_PA1_ 1
#define _UART2_DE_PA12_ 1
#define _UART2_DE_PB0_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF4
#define UART2_RTS_PA12_ PA12,GPIO_AF4
#define UART2_RTS_PB0_ PB0,GPIO_AF4
#define _UART2_RTS_PA1_ 1
#define _UART2_RTS_PA12_ 1
#define _UART2_RTS_PB0_ 1

#define UART2_RX_PA0_ PA0,GPIO_AF0
#define UART2_RX_PA10_ PA10,GPIO_AF4
#define UART2_RX_PA15_ PA15,GPIO_AF4
#define UART2_RX_PA3_ PA3,GPIO_AF4
#define UART2_RX_PB7_ PB7,GPIO_AF0
#define _UART2_RX_PA0_ 1
#define _UART2_RX_PA10_ 1
#define _UART2_RX_PA15_ 1
#define _UART2_RX_PA3_ 1
#define _UART2_RX_PB7_ 1

#define UART2_TX_PA14_ PA14,GPIO_AF4
#define UART2_TX_PA2_ PA2,GPIO_AF4
#define UART2_TX_PA9_ PA9,GPIO_AF4
#define UART2_TX_PB6_ PB6,GPIO_AF0
#define UART2_TX_PB8_ PB8,GPIO_AF0
#define _UART2_TX_PA14_ 1
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PA9_ 1
#define _UART2_TX_PB6_ 1
#define _UART2_TX_PB8_ 1

#define UART3_CTS_PA6_ PA6,GPIO_AF4
#define _UART3_CTS_PA6_ 1

#define UART3_DE_PB1_ PB1,GPIO_AF4
#define _UART3_DE_PB1_ 1

#define UART3_RTS_PB1_ PB1,GPIO_AF4
#define _UART3_RTS_PB1_ 1

#define UART3_RX_PA0_ PA0,GPIO_AF6
#define UART3_RX_PA13_ PA13,GPIO_AF6
#define UART3_RX_PA3_ PA3,GPIO_AF6
#define UART3_RX_PB7_ PB7,GPIO_AF6
#define _UART3_RX_PA0_ 1
#define _UART3_RX_PA13_ 1
#define _UART3_RX_PA3_ 1
#define _UART3_RX_PB7_ 1

#define UART3_TX_PA1_ PA1,GPIO_AF6
#define UART3_TX_PA14_ PA14,GPIO_AF6
#define UART3_TX_PA2_ PA2,GPIO_AF6
#define UART3_TX_PA4_ PA4,GPIO_AF6
#define UART3_TX_PB6_ PB6,GPIO_AF6
#define _UART3_TX_PA1_ 1
#define _UART3_TX_PA14_ 1
#define _UART3_TX_PA2_ 1
#define _UART3_TX_PA4_ 1
#define _UART3_TX_PB6_ 1

#define USART2_CK_PA4_ PA4,GPIO_AF4
#define USART2_CK_PA8_ PA8,GPIO_AF4
#define USART2_CK_PB1_ PB1,GPIO_AF0
#define _USART2_CK_PA4_ 1
#define _USART2_CK_PA8_ 1
#define _USART2_CK_PB1_ 1

#define USART2_CTS_PA0_ PA0,GPIO_AF4
#define USART2_CTS_PA11_ PA11,GPIO_AF4
#define USART2_CTS_PA7_ PA7,GPIO_AF4
#define _USART2_CTS_PA0_ 1
#define _USART2_CTS_PA11_ 1
#define _USART2_CTS_PA7_ 1

#define USART2_DE_PA1_ PA1,GPIO_AF4
#define USART2_DE_PA12_ PA12,GPIO_AF4
#define USART2_DE_PB0_ PB0,GPIO_AF4
#define _USART2_DE_PA1_ 1
#define _USART2_DE_PA12_ 1
#define _USART2_DE_PB0_ 1

#define USART2_RTS_PA1_ PA1,GPIO_AF4
#define USART2_RTS_PA12_ PA12,GPIO_AF4
#define USART2_RTS_PB0_ PB0,GPIO_AF4
#define _USART2_RTS_PA1_ 1
#define _USART2_RTS_PA12_ 1
#define _USART2_RTS_PB0_ 1

#define USART2_RX_PA0_ PA0,GPIO_AF0
#define USART2_RX_PA10_ PA10,GPIO_AF4
#define USART2_RX_PA15_ PA15,GPIO_AF4
#define USART2_RX_PA3_ PA3,GPIO_AF4
#define USART2_RX_PB7_ PB7,GPIO_AF0
#define _USART2_RX_PA0_ 1
#define _USART2_RX_PA10_ 1
#define _USART2_RX_PA15_ 1
#define _USART2_RX_PA3_ 1
#define _USART2_RX_PB7_ 1

#define USART2_TX_PA14_ PA14,GPIO_AF4
#define USART2_TX_PA2_ PA2,GPIO_AF4
#define USART2_TX_PA9_ PA9,GPIO_AF4
#define USART2_TX_PB6_ PB6,GPIO_AF0
#define USART2_TX_PB8_ PB8,GPIO_AF0
#define _USART2_TX_PA14_ 1
#define _USART2_TX_PA2_ 1
#define _USART2_TX_PA9_ 1
#define _USART2_TX_PB6_ 1
#define _USART2_TX_PB8_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */